docs/feed-2026-04-21.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-04-24 Fri 00:07 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Technical Digest 2026-04-21</title>
<meta name="author" content="Aleksandr Savchenko" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<div id="navbar">

<div id="home" class="horizontal home">
<p>
<a href="index.html">Home</a>
</p>

</div>

<div id="home-nav" class="horizontal home-nav">
<p>
<a href="posts.html">Blog</a>
<a href="tools.html">Tools</a>
<a href="about.html">About</a>
</p>

</div>

</div> <!-- #navbar -->
<div class="digest-page">
<div id="outline-container-org2e47895" class="outline-2">
<h2 id="org2e47895">Papers</h2>
<div class="outline-text-2" id="text-org2e47895">
</div>
<div id="outline-container-org14ecd37" class="outline-3">
<h3 id="org14ecd37"><a href="https://arxiv.org/abs/2604.17046v1">A Real-Time Bike-Pedestrian Safety System with Wide-Angle Perception and Evaluation Testbed for Urban Intersections</a></h3>
<div class="outline-text-3" id="text-org14ecd37">
<p>
arXiv Vision | Mehmet Kerem Turkcan | 2026-04-18
</p>

<ul class="org-ul">
<li>A real-time fisheye safety stack that combines calibration, projection, and deployment-risk validation for intersections.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfae2e15" class="outline-3">
<h3 id="orgfae2e15"><a href="https://arxiv.org/abs/2604.17231v1">Fringe Projection Based Vision Pipeline for Autonomous Hard Drive Disassembly</a></h3>
<div class="outline-text-3" id="text-orgfae2e15">
<p>
arXiv Vision | Badrinath Balasubramaniam | 2026-04-19
</p>

<ul class="org-ul">
<li>A fringe-projection pipeline that aligns depth completion and segmentation for robotic HDD disassembly.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc9f56ca" class="outline-3">
<h3 id="orgc9f56ca"><a href="https://arxiv.org/abs/2604.14795v1">Keep It CALM: Toward Calibration-Free Kilometer-Level SLAM with Visual Geometry Foundation Models via an Assistant Eye</a></h3>
<div class="outline-text-3" id="text-orgc9f56ca">
<p>
arXiv Robotics and Geometry | Tianjun Zhang | 2026-04-16
</p>

<ul class="org-ul">
<li>A calibration-aware SLAM approach that corrects intrinsics and pose to improve long-range geometric consistency.</li>
</ul>
</div>
</div>
<div id="outline-container-org0459603" class="outline-3">
<h3 id="org0459603"><a href="https://arxiv.org/abs/2604.18476v1">SemLT3D: Semantic-Guided Expert Distillation for Camera-only Long-Tailed 3D Object Detection</a></h3>
<div class="outline-text-3" id="text-org0459603">
<p>
arXiv Vision | Hao Vo | 2026-04-20
</p>

<ul class="org-ul">
<li>Camera-only long-tail 3D detection improved with semantic expert routing and CLIP-guided distillation.</li>
</ul>
</div>
</div>
<div id="outline-container-org11b2005" class="outline-3">
<h3 id="org11b2005"><a href="https://arxiv.org/abs/2604.14454v1">CooperDrive: Enhancing Driving Decisions Through Cooperative Perception</a></h3>
<div class="outline-text-3" id="text-org11b2005">
<p>
arXiv Vision | Deyuan Qu | 2026-04-15
</p>

<ul class="org-ul">
<li>Cooperative perception fuses shared object context to improve BEV driving decisions under occlusion.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1e91195" class="outline-2">
<h2 id="org1e91195">Projects</h2>
<div class="outline-text-2" id="text-org1e91195">
</div>
<div id="outline-container-orgfaa0848" class="outline-3">
<h3 id="orgfaa0848"><a href="https://github.com/eowjd0512/fisheye-calib-adapter">eowjd0512/fisheye-calib-adapter</a></h3>
<div class="outline-text-3" id="text-orgfaa0848">
<p>
GitHub Vision Geometry C++ | eowjd0512 | 2026-04-07
</p>

<ul class="org-ul">
<li>Adapter code that converts between multiple fisheye camera models for real-system interoperability.</li>
</ul>
</div>
</div>
<div id="outline-container-org5668677" class="outline-3">
<h3 id="org5668677"><a href="https://github.com/xixu-me/avm">xixu-me/avm</a></h3>
<div class="outline-text-3" id="text-org5668677">
<p>
GitHub Fisheye Geometry | xixu-me | 2026-04-20
</p>

<ul class="org-ul">
<li>Practical around-view monitoring pipeline from fisheye images to bird's-eye-view output.</li>
</ul>
</div>
</div>
<div id="outline-container-org628bf13" class="outline-3">
<h3 id="org628bf13"><a href="https://github.com/fundamentalvision/BEVFormer">fundamentalvision/BEVFormer</a></h3>
<div class="outline-text-3" id="text-org628bf13">
<p>
GitHub Automotive Perception | fundamentalvision | 2026-04-21
</p>

<ul class="org-ul">
<li>Canonical camera-only BEV perception framework for multi-camera autonomous-driving scenes.</li>
</ul>
</div>
</div>
<div id="outline-container-org25c421b" class="outline-3">
<h3 id="org25c421b"><a href="https://github.com/sourishg/fisheye-stereo-calibration">sourishg/fisheye-stereo-calibration</a></h3>
<div class="outline-text-3" id="text-org25c421b">
<p>
GitHub Vision Geometry C++ | sourishg | 2026-03-06
</p>

<ul class="org-ul">
<li>C++ OpenCV reference implementation for stereo fisheye calibration.</li>
</ul>
</div>
</div>
<div id="outline-container-orge1d5dbd" class="outline-3">
<h3 id="orge1d5dbd"><a href="https://github.com/astar-ai/calicam_mono">astar-ai/calicam<sub>mono</sub></a></h3>
<div class="outline-text-3" id="text-orge1d5dbd">
<p>
GitHub Vision Geometry C++ | astar-ai | 2026-03-16
</p>

<ul class="org-ul">
<li>Fisheye rectification tool that outputs multiple projection formats for downstream perception.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfbbd42a" class="outline-2">
<h2 id="orgfbbd42a">Posts</h2>
<div class="outline-text-2" id="text-orgfbbd42a">
</div>
<div id="outline-container-orgb85a326" class="outline-3">
<h3 id="orgb85a326"><a href="https://www.tangramvision.com/blog/nfov-calibration-made-easier">Oct 24, 2025 Narrow FOV Calibration Made Easy(er)</a></h3>
<div class="outline-text-3" id="text-orgb85a326">
<p>
Tangram Vision Blog | 2026-04-21
</p>

<ul class="org-ul">
<li>Explains narrow-FOV calibration failure modes and practical mitigation strategies.</li>
</ul>
</div>
</div>
<div id="outline-container-org7d2c335" class="outline-3">
<h3 id="org7d2c335"><a href="https://www.tangramvision.com/blog/plane-fitting-part-2-manifold-optimization-without-lie-groups">Dec 9, 2025 Plane Fitting, Part 2: Manifold Optimization, without Lie Groups</a></h3>
<div class="outline-text-3" id="text-org7d2c335">
<p>
Tangram Vision Blog | 2026-04-21
</p>

<ul class="org-ul">
<li>Reframes plane fitting as manifold optimization without standard Lie-group machinery.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org60fdd23" class="outline-2">
<h2 id="org60fdd23">Filtered But Worth Checking</h2>
<div class="outline-text-2" id="text-org60fdd23">
<p>
These were not in the main digest, but each has one useful core idea.
</p>

<ul class="org-ul">
<li><a href="https://arxiv.org/abs/2604.18289v1">Relative State Estimation using Event-Based Propeller Sensing</a>
Event-camera propeller cues for UAV relative state estimation.</li>
<li><a href="https://blog.llvm.org/posts/2025-08-gsoc-lldb-rich-disassembler/">GSoC 2025: Rich Disassembler for LLDB</a>
LLDB disassembly UX and visualization improvements.</li>
<li><a href="https://developer.nvidia.com/blog/how-to-build-vision-ai-pipelines-using-deepstream-coding-agents/">How to Build Vision AI Pipelines Using NVIDIA DeepStream Coding Agents</a>
Agent-assisted workflow for building DeepStream vision pipelines.</li>
<li><a href="https://blog.llvm.org/posts/2025-08-25-abi-library/">GSoC 2025: Introducing an ABI Lowering Library</a>
Reusable ABI lowering components for compiler tooling.</li>
<li><a href="https://blog.roboflow.com/inference-1-0/">Inference 1.0: Foundational Infrastructure for Visual Understanding</a>
Deployment-oriented infrastructure for vision inference workloads.</li>
<li><a href="https://blog.llvm.org/posts/2025-08-31-gsoc-llvm-advisor/">Making LLVM Compilation Data Accessible: A Unified Visualization Tool for Compiler Artifacts</a>
Unified visualization for scattered LLVM compilation artifacts.</li>
<li><a href="https://pytorch.org/blog/gemms-torchinductor-cutedsl-backend/">Generating State-of-the-Art GEMMs with TorchInductor’s CuteDSL backend</a>
Compiler-driven GEMM generation with high kernel performance.</li>
<li><a href="https://blog.llvm.org/posts/2025-gsoc-clangir-upstreaming/">GSoC 2025: ClangIR upstreaming</a>
Progress on upstreaming ClangIR into LLVM/Clang.</li>
<li><a href="https://github.com/ankitghoshthecreator/monoCar_detection">ankitghoshthecreator/monoCar<sub>detection</sub></a>
Monocular car detection with geometric priors for 3D cues.</li>
<li><a href="https://blog.roboflow.com/build-robots-vision-ai/">How to Build Factory Robots with Vision AI</a>
Practical steps for deploying vision in factory robotics.</li>
<li><a href="https://github.com/4rtur1t0/fisheye_calibration">4rtur1t0/fisheye<sub>calibration</sub></a>
Basic OpenCV fisheye calibration workflow.</li>
<li><a href="https://pytorch.org/blog/faster-diffusion-on-blackwell-mxfp8-and-nvfp4-with-diffusers-and-torchao/">Faster Diffusion on Blackwell: MXFP8 and NVFP4 with Diffusers and TorchAO</a>
Blackwell low-precision diffusion acceleration techniques.</li>
<li><a href="https://arxiv.org/abs/2604.16855v1">When W4A4 Breaks Camouflaged Object Detection: Token-Group Dual-Constraint Activation Quantization</a>
Why 4-bit activation quantization fails on camouflaged detection.</li>
<li><a href="https://developer.nvidia.com/blog/build-synthetic-data-pipelines-to-train-smarter-robots-with-nvidia-isaac-sim/">Build and Orchestrate End-to-End SDG Workflows with NVIDIA Isaac Sim and NVIDIA OSMO</a>
End-to-end synthetic-data orchestration for robotics training.</li>
<li><a href="https://pytorch.org/blog/sota-normalization-performance-with-torch-compile/">SOTA Normalization Performance with torch.compile</a>
Faster normalization ops via torch.compile optimization.</li>
<li><a href="https://arxiv.org/abs/2604.18484v1">XEmbodied: A Foundation Model with Enhanced Geometric and Physical Cues for Large-Scale Embodied Environments</a>
Embodied foundation model strengthened with geometry and physics cues.</li>
<li><a href="https://developer.nvidia.com/blog/optimizing-semiconductor-defect-classification-with-generative-ai-and-vision-foundation-models/">Optimizing Semiconductor Defect Classification with Generative AI and Vision Foundation Models</a>
Industrial defect classification with foundation-model vision pipelines.</li>
<li><a href="https://developer.nvidia.com/blog/getting-started-with-edge-ai-on-nvidia-jetson-llms-vlms-and-foundation-models-for-robotics/">Getting Started with Edge AI on NVIDIA Jetson: LLMs, VLMs, and Foundation Models for Robotics</a>
Intro path for Jetson edge AI with modern foundation models.</li>
<li><a href="https://www.tangramvision.com/blog/tangram-vision-opencv-announcement">Apr 7, 2026 Tangram Vision and OpenCV Team Up</a>
Partnership announcement around calibration-focused tooling.</li>
<li><a href="https://github.com/prajesdas/Smart-Parking-Space-Detector-using-YOLO-and-OpenCV">prajesdas/Smart-Parking-Space-Detector-using-YOLO-and-OpenCV</a>
YOLO/OpenCV smart parking space occupancy detection.</li>
<li><a href="https://blog.roboflow.com/rf-detr-segmentation/">New RF-DETR Segmentation Checkpoints from Nano to 2XLarge</a>
New segmentation checkpoints across RF-DETR model sizes.</li>
<li><a href="https://pytorch.org/blog/optimizing-effective-training-time-for-metas-internal-recommendation-ranking-workloads/">Optimizing Effective Training Time for Meta’s Internal Recommendation/Ranking Workloads</a>
System-level optimization for recommendation model training throughput.</li>
<li><a href="https://arxiv.org/abs/2604.17623v1">ViPS: Video-informed Pose Spaces for Auto-Rigged Meshes</a>
Video-conditioned pose spaces for rigged character meshes.</li>
<li><a href="https://blog.roboflow.com/automating-conidia-counting/">Revolutionizing Conidia Counting with Roboflow</a>
Vision workflow for automating conidia counting.</li>
<li><a href="https://arxiv.org/abs/2604.17919v1">Fisher Decorator: Refining Flow Policy via A Local Transport Map</a>
Local transport maps for improving offline RL flow policies.</li>
<li><a href="https://pytorch.org/blog/monarch-an-api-to-your-supercomputer/">Monarch: an API to your supercomputer</a>
API abstraction layer for HPC/supercomputer access.</li>
<li><a href="https://github.com/Sumukh73/smart-parking-capacity-enforcement-system">Sumukh73/smart-parking-capacity-enforcement-system</a>
Parking enforcement system combining CCTV, IoT, and dashboards.</li>
<li><a href="https://opencv.org/when-the-track-is-your-lab-meet-the-team-racing-without-a-driver/">When the Track Is Your Lab: Meet the Team Racing Without a Driver</a>
Autonomous racing team profile and development context.</li>
<li><a href="https://github.com/MrDaila007/Park_space_detector_Yolov8">MrDaila007/Park<sub>space</sub><sub>detector</sub><sub>Yolov8</sub></a>
YOLOv8 parking detector with polygon-zone occupancy tracking.</li>
<li><a href="https://huggingface.co/blog/train-multimodal-sentence-transformers">Training and Finetuning Multimodal Embedding &amp; Reranker Models with Sentence Transformers</a>
Recipe for multimodal embedding and reranker training.</li>
<li><a href="https://github.com/omerfarooq223/parking-detection-system">omerfarooq223/parking-detection-system</a>
Standard YOLO/OpenCV parking detection implementation.</li>
<li><a href="https://opencv.org/glenn-jocher-of-ultralytics-yolo-is-speaking-at-oscca/">Glenn Jocher of Ultralytics (YOLO) Is Speaking at OSCCA</a>
Conference speaker announcement for Ultralytics leadership.</li>
<li><a href="https://arxiv.org/abs/2604.17887v1">StableIDM: Stabilizing Inverse Dynamics Model against Manipulator Truncation via Spatio-Temporal Refinement</a>
Stabilized inverse-dynamics modeling for truncated manipulator trajectories.</li>
<li><a href="https://github.com/Dhruvangbari/AI-Smart-Parking-Occupancy-Detection-System-YOLOv8-OpenCV-">Dhruvangbari/AI-Smart-Parking-Occupancy-Detection-System-YOLOv8-OpenCV-</a>
YOLOv8/OpenCV smart parking occupancy detection project.</li>
<li><a href="https://opencv.org/how-pg-uses-ai-to-understand-human-behavior/">How P&amp;G Uses AI to Understand Human Behavior</a>
Applied CV case study for consumer behavior analysis.</li>
<li><a href="https://huggingface.co/blog/transformers-to-mlx">The PR you would have opened yourself</a>
Automation approach for framework migration pull requests.</li>
<li><a href="https://opencv.org/behind-the-magic-disney-research-imagineerings-doug-fidaleo-comes-to-oscca/">Behind the Magic: Disney Research Imagineering’s Doug Fidaleo Comes to OSCCA</a>
Conference preview featuring Disney Research Imagineering speaker.</li>
<li><a href="https://blog.roboflow.com/better-consumer-experiences-vision-ai/">How to Deliver Better Consumer Experiences with Vision AI</a>
Business-facing guidance on vision AI in consumer products.</li>
<li><a href="https://blog.llvm.org/posts/2025-11-11-advanced-symbol-resolution-for-clang-repl/">GSoC 2025: Advanced symbol resolution for Clang-Repl</a>
Better symbol resolution pipeline for Clang REPL.</li>
<li><a href="https://www.tangramvision.com/blog/moving-metrical-metrics-to-mcaps">Sep 16, 2025 Moving MetriCal Metrics to MCAPs</a>
Migrating calibration metrics storage to MCAP format.</li>
<li><a href="https://opencv.org/the-founder-of-opencv-is-speaking-at-oscca-dont-miss-it/">The Founder of OpenCV Is Speaking at OSCCA, Don’t Miss It!</a>
Event announcement featuring OpenCV founder talk.</li>
<li><a href="https://developer.nvidia.com/blog/nvidia-accelerated-mistral-3-open-models-deliver-efficiency-accuracy-at-any-scale/">NVIDIA-Accelerated Mistral 3 Open Models Deliver Efficiency, Accuracy at Any Scale</a>
NVIDIA acceleration story for Mistral 3 open models.</li>
<li><a href="https://huggingface.co/blog/nvidia/build-korean-agents-with-nemotron-personas">How to Ground a Korean AI Agent in Real Demographics with Synthetic Personas</a>
Synthetic persona generation for demographic grounding.</li>
<li><a href="https://huggingface.co/blog/ecom-rlve">Ecom-RLVE: Adaptive Verifiable Environments for E-Commerce Conversational Agents</a>
Benchmark-style environment for e-commerce conversational agents.</li>
<li><a href="https://arxiv.org/abs/2604.18090v1">Muscle-inspired magnetic actuators that push, pull, crawl, and grasp</a>
Soft robotic actuation with muscle-like magnetic structures.</li>
<li><a href="https://huggingface.co/blog/tiiuae/qimma-arabic-leaderboard">QIMMA قِمّة ⛰: A Quality-First Arabic LLM Leaderboard</a>
Quality-focused benchmark leaderboard for Arabic LLMs.</li>
<li><a href="https://www.tangramvision.com/blog/pay-for-what-you-calibrate-tangram-vision-introduces-credit-based-licensing">Nov 19, 2025 Announcing Public Pricing and Credit-Based Licensing for MetriCal</a>
Pricing and licensing update for MetriCal.</li>
</ul>

</div>
</div>
</div>
</div>
</body>
</html>
